scchiang/gitrepository/mb9bf51_ib23811_encoder/common/mb9b510n.h
typedef struct stc_exbus_tim5_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim5_field_t;

typedef struct stc_exbus_tim6_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim6_field_t;

typedef struct stc_exbus_tim7_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim7_field_t;

typedef struct stc_exbus_area0_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area0_field_t;

typedef struct stc_exbus_area1_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area1_field_t;

typedef struct stc_exbus_area2_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area2_field_t;

typedef struct stc_exbus_area3_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area3_field_t;

typedef struct stc_exbus_area4_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area4_field_t;

typedef struct stc_exbus_area5_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area5_field_t;

typedef struct stc_exbus_area6_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area6_field_t;

typedef struct stc_exbus_area7_field
{
  __IO uint32_t ADDR0      : 1;
  __IO uint32_t ADDR1      : 1;
  __IO uint32_t ADDR2      : 1;
  __IO uint32_t ADDR3      : 1;
  __IO uint32_t ADDR4      : 1;
  __IO uint32_t ADDR5      : 1;
  __IO uint32_t ADDR6      : 1;
  __IO uint32_t ADDR7      : 1;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK0      : 1;
  __IO uint32_t MASK1      : 1;
  __IO uint32_t MASK2      : 1;
  __IO uint32_t MASK3      : 1;
  __IO uint32_t MASK4      : 1;
  __IO uint32_t MASK5      : 1;
  __IO uint32_t MASK6      : 1;
} stc_exbus_area7_field_t;

