scchiang/gitrepository/mb9bf51_ib23811_encoder/common/mb9b510n.h
typedef struct stc_exbus_atim0_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim0_field_t;

typedef struct stc_exbus_atim1_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim1_field_t;

typedef struct stc_exbus_atim2_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim2_field_t;

typedef struct stc_exbus_atim3_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim3_field_t;

typedef struct stc_exbus_atim4_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim4_field_t;

typedef struct stc_exbus_atim5_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim5_field_t;

typedef struct stc_exbus_atim6_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim6_field_t;

typedef struct stc_exbus_atim7_field
{
  __IO uint16_t ALC0       : 1;
  __IO uint16_t ALC1       : 1;
  __IO uint16_t ALC2       : 1;
  __IO uint16_t ALC3       : 1;
  __IO uint16_t ALES0      : 1;
  __IO uint16_t ALES1      : 1;
  __IO uint16_t ALES2      : 1;
  __IO uint16_t ALES3      : 1;
  __IO uint16_t ALEW0      : 1;
  __IO uint16_t ALEW1      : 1;
  __IO uint16_t ALEW2      : 1;
  __IO uint16_t ALEW3      : 1;
} stc_exbus_atim7_field_t;

typedef struct stc_exbus_dclkr_field
{
  __IO  uint8_t MDIV0      : 1;
  __IO  uint8_t MDIV1      : 1;
  __IO  uint8_t MDIV2      : 1;
  __IO  uint8_t MDIV3      : 1;
  __IO  uint8_t MCLKON     : 1;
} stc_exbus_dclkr_field_t;

/******************************************************************************
 * USB_MODULE
 ******************************************************************************/
/* USB_MODULE register bit fields */
typedef struct stc_usb_hcnt_field
{
  __IO uint16_t HOST       : 1;
  __IO uint16_t URST       : 1;
  __IO uint16_t SOFIRE     : 1;
  __IO uint16_t DIRE       : 1;
  __IO uint16_t CNNIRE     : 1;
  __IO uint16_t CMPIRE     : 1;
  __IO uint16_t URIRE      : 1;
  __IO uint16_t RWKIRE     : 1;
  __IO uint16_t RETRY      : 1;
  __IO uint16_t CANCEL     : 1;
  __IO uint16_t SOFSTEP    : 1;
} stc_usb_hcnt_field_t;

typedef struct stc_usb_hcnt0_field
{
  __IO  uint8_t HOST       : 1;
  __IO  uint8_t URST       : 1;
  __IO  uint8_t SOFIRE     : 1;
  __IO  uint8_t DIRE       : 1;
  __IO  uint8_t CNNIRE     : 1;
  __IO  uint8_t CMPIRE     : 1;
  __IO  uint8_t URIRE      : 1;
  __IO  uint8_t RWKIRE     : 1;
} stc_usb_hcnt0_field_t;

typedef struct stc_usb_hcnt1_field
{
  __IO  uint8_t RETRY      : 1;
  __IO  uint8_t CANCEL     : 1;
  __IO  uint8_t SOFSTEP    : 1;
} stc_usb_hcnt1_field_t;

typedef struct stc_usb_hirq_field
{
  __IO  uint8_t SOFIRQ     : 1;
  __IO  uint8_t DIRQ       : 1;
  __IO  uint8_t CNNIRQ     : 1;
  __IO  uint8_t CMPIRQ     : 1;
  __IO  uint8_t URIRQ      : 1;
  __IO  uint8_t RWKIRQ     : 1;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t TCAN       : 1;
} stc_usb_hirq_field_t;

typedef struct stc_usb_herr_field
{
  __IO  uint8_t HS0        : 1;
  __IO  uint8_t HS1        : 1;
  __IO  uint8_t STUFF      : 1;
  __IO  uint8_t TGERR      : 1;
  __IO  uint8_t CRC        : 1;
  __IO  uint8_t TOUT       : 1;
  __IO  uint8_t RERR       : 1;
  __IO  uint8_t LSTOF      : 1;
} stc_usb_herr_field_t;

typedef struct stc_usb_hstate_field
{
  __IO  uint8_t CSTAT      : 1;
  __IO  uint8_t TMODE      : 1;
  __IO  uint8_t SUSP       : 1;
  __IO  uint8_t SOFBUSY    : 1;
  __IO  uint8_t CLKSEL     : 1;
  __IO  uint8_t ALIVE      : 1;
} stc_usb_hstate_field_t;

typedef struct stc_usb_hfcomp_field
{
  __IO  uint8_t FRAMECOMP0 : 1;
  __IO  uint8_t FRAMECOMP1 : 1;
  __IO  uint8_t FRAMECOMP2 : 1;
  __IO  uint8_t FRAMECOMP3 : 1;
  __IO  uint8_t FRAMECOMP4 : 1;
  __IO  uint8_t FRAMECOMP5 : 1;
  __IO  uint8_t FRAMECOMP6 : 1;
  __IO  uint8_t FRAMECOMP7 : 1;
} stc_usb_hfcomp_field_t;

