scchiang/gitrepository/mb9bf51_ib23811_encoder/common/mb9b510n.h
/******************************************************************************
 * MFS_NFC_MODULE
 ******************************************************************************/
/* MFS_NFC_MODULE register bit fields */
typedef struct
{
  union {
    __IO  uint16_t I2CDNF;
    stc_mfs_nfc_i2cdnf_field_t I2CDNF_f;
  };
}FM3_MFS_NFC_TypeDef;

/******************************************************************************
 * CRC_MODULE
 ******************************************************************************/
/* CRC registers */
typedef struct
{
  union {
    __IO  uint8_t CRCCR;
    stc_crc_crccr_field_t CRCCR_f;
  };
        uint8_t RESERVED0[3];
  __IO uint32_t CRCINIT;
  union {
    __IO uint32_t CRCIN;
    struct {
      union {
        __IO uint16_t CRCINL;
        struct {
          __IO  uint8_t CRCINLL;
          __IO  uint8_t CRCINLH;
        };
      };
      union {
        __IO uint16_t CRCINH;
        struct {
          __IO  uint8_t CRCINHL;
          __IO  uint8_t CRCINHH;
        };
      };
    };
  };
  __IO uint32_t CRCR;
}FM3_CRC_TypeDef;

/******************************************************************************
 * WC_MODULE
 ******************************************************************************/
/* Watch counter registers */
typedef struct
{
  union {
    __IO  uint8_t WCRD;
    stc_wc_wcrd_field_t WCRD_f;
  };
  union {
    __IO  uint8_t WCRL;
    stc_wc_wcrl_field_t WCRL_f;
  };
  union {
    __IO  uint8_t WCCR;
    stc_wc_wccr_field_t WCCR_f;
  };
        uint8_t RESERVED0[13];
  union {
    __IO uint16_t CLK_SEL;
    stc_wc_clk_sel_field_t CLK_SEL_f;
  };
        uint8_t RESERVED1[2];
  union {
    __IO  uint8_t CLK_EN;
    stc_wc_clk_en_field_t CLK_EN_f;
  };
}FM3_WC_TypeDef;

/******************************************************************************
 * RTC_MODULE
 ******************************************************************************/
/* Realtime clock registers */
typedef struct
{
  union {
    __IO uint32_t WTCR1;
    stc_rtc_wtcr1_field_t WTCR1_f;
  };
  union {
    __IO uint32_t WTCR2;
    stc_rtc_wtcr2_field_t WTCR2_f;
  };
  union {
    __IO uint32_t WTBR;
    stc_rtc_wtbr_field_t WTBR_f;
  };
  union {
    __IO  uint8_t WTSR;
    stc_rtc_wtsr_field_t WTSR_f;
  };
  union {
    __IO  uint8_t WTMIR;
    stc_rtc_wtmir_field_t WTMIR_f;
  };
  union {
    __IO  uint8_t WTHR;
    stc_rtc_wthr_field_t WTHR_f;
  };
  union {
    __IO  uint8_t WTDR;
    stc_rtc_wtdr_field_t WTDR_f;
  };
  union {
    __IO  uint8_t WTDW;
    stc_rtc_wtdw_field_t WTDW_f;
  };
  union {
    __IO  uint8_t WTMOR;
    stc_rtc_wtmor_field_t WTMOR_f;
  };
  union {
    __IO  uint8_t WTYR;
    stc_rtc_wtyr_field_t WTYR_f;
  };
        uint8_t RESERVED0[2];
  union {
    __IO  uint8_t ALMIR;
    stc_rtc_almir_field_t ALMIR_f;
  };
  union {
    __IO  uint8_t ALHR;
    stc_rtc_alhr_field_t ALHR_f;
  };
  union {
    __IO  uint8_t ALDR;
    stc_rtc_aldr_field_t ALDR_f;
  };
        uint8_t RESERVED1;
  union {
    __IO  uint8_t ALMOR;
    stc_rtc_almor_field_t ALMOR_f;
  };
  union {
    __IO  uint8_t ALYR;
    stc_rtc_alyr_field_t ALYR_f;
  };
        uint8_t RESERVED2;
  union {
    __IO uint32_t WTTR;
    stc_rtc_wttr_field_t WTTR_f;
  };
  union {
    __IO  uint8_t WTCLKS;
    stc_rtc_wtclks_field_t WTCLKS_f;
  };
  union {
    __IO  uint8_t WTCLKM;
    stc_rtc_wtclkm_field_t WTCLKM_f;
  };
        uint8_t RESERVED3[2];
  union {
    __IO  uint8_t WTCAL;
    stc_rtc_wtcal_field_t WTCAL_f;
  };
  union {
    __IO  uint8_t WTCALEN;
    stc_rtc_wtcalen_field_t WTCALEN_f;
  };
        uint8_t RESERVED4[2];
  union {
    __IO  uint8_t WTDIV;
    stc_rtc_wtdiv_field_t WTDIV_f;
  };
  union {
    __IO  uint8_t WTDIVEN;
    stc_rtc_wtdiven_field_t WTDIVEN_f;
  };
}FM3_RTC_TypeDef;

/******************************************************************************
 * EXBUS_MODULE
 ******************************************************************************/
/* External bus interface registers */
typedef struct
{
  union {
    __IO uint32_t MODE0;
    stc_exbus_mode0_field_t MODE0_f;
  };
  union {
    __IO uint32_t MODE1;
    stc_exbus_mode1_field_t MODE1_f;
  };
  union {
    __IO uint32_t MODE2;
    stc_exbus_mode2_field_t MODE2_f;
  };
  union {
    __IO uint32_t MODE3;
    stc_exbus_mode3_field_t MODE3_f;
  };
  union {
    __IO uint32_t MODE4;
    stc_exbus_mode4_field_t MODE4_f;
  };
  union {
    __IO uint32_t MODE5;
    stc_exbus_mode5_field_t MODE5_f;
  };
  union {
    __IO uint32_t MODE6;
    stc_exbus_mode6_field_t MODE6_f;
  };
  union {
    __IO uint32_t MODE7;
    stc_exbus_mode7_field_t MODE7_f;
  };
  union {
    __IO uint32_t TIM0;
    stc_exbus_tim0_field_t TIM0_f;
  };
  union {
    __IO uint32_t TIM1;
    stc_exbus_tim1_field_t TIM1_f;
  };
  union {
    __IO uint32_t TIM2;
    stc_exbus_tim2_field_t TIM2_f;
  };
  union {
    __IO uint32_t TIM3;
    stc_exbus_tim3_field_t TIM3_f;
  };
  union {
    __IO uint32_t TIM4;
    stc_exbus_tim4_field_t TIM4_f;
  };
  union {
    __IO uint32_t TIM5;
    stc_exbus_tim5_field_t TIM5_f;
  };
  union {
    __IO uint32_t TIM6;
    stc_exbus_tim6_field_t TIM6_f;
  };
  union {
    __IO uint32_t TIM7;
    stc_exbus_tim7_field_t TIM7_f;
  };
  union {
    __IO uint32_t AREA0;
    stc_exbus_area0_field_t AREA0_f;
  };
  union {
    __IO uint32_t AREA1;
    stc_exbus_area1_field_t AREA1_f;
  };
  union {
    __IO uint32_t AREA2;
    stc_exbus_area2_field_t AREA2_f;
  };
  union {
    __IO uint32_t AREA3;
    stc_exbus_area3_field_t AREA3_f;
  };
  union {
    __IO uint32_t AREA4;
    stc_exbus_area4_field_t AREA4_f;
  };
  union {
    __IO uint32_t AREA5;
    stc_exbus_area5_field_t AREA5_f;
  };
  union {
    __IO uint32_t AREA6;
    stc_exbus_area6_field_t AREA6_f;
  };
  union {
    __IO uint32_t AREA7;
    stc_exbus_area7_field_t AREA7_f;
  };
  union {
    __IO uint16_t ATIM0;
    stc_exbus_atim0_field_t ATIM0_f;
  };
        uint8_t RESERVED0[2];
  union {
    __IO uint16_t ATIM1;
    stc_exbus_atim1_field_t ATIM1_f;
  };
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t ATIM2;
    stc_exbus_atim2_field_t ATIM2_f;
  };
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t ATIM3;
    stc_exbus_atim3_field_t ATIM3_f;
  };
        uint8_t RESERVED3[2];
  union {
    __IO uint16_t ATIM4;
    stc_exbus_atim4_field_t ATIM4_f;
  };
        uint8_t RESERVED4[2];
  union {
    __IO uint16_t ATIM5;
    stc_exbus_atim5_field_t ATIM5_f;
  };
        uint8_t RESERVED5[2];
  union {
    __IO uint16_t ATIM6;
    stc_exbus_atim6_field_t ATIM6_f;
  };
        uint8_t RESERVED6[2];
  union {
    __IO uint16_t ATIM7;
    stc_exbus_atim7_field_t ATIM7_f;
  };
        uint8_t RESERVED7[642];
  union {
    __IO  uint8_t DCLKR;
    stc_exbus_dclkr_field_t DCLKR_f;
  };
}FM3_EXBUS_TypeDef;

